filipembedded/zephyr/drivers/mspi/mspi_stm32_xspi_hal2.c
/*
 * Copyright (c) 2026 Filip Stojanovic <filipembedded@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * MSPI flash controller driver for STM32 series with an XSPI peripheral
 * handled by the STM32Cube2 (HAL2) XSPI driver, e.g. STM32C5.
 *
 * Functional twin of mspi_stm32_xspi.c (legacy STM32Cube HAL); the two are
 * never built together (see the MSPI_STM32_XSPI_HAL_API_VERSION choice).
 */

#define DT_DRV_COMPAT st_stm32_xspi_controller

#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/mspi.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <stm32_ll_dma.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/irq.h>
#include "mspi_stm32.h"

LOG_MODULE_REGISTER(mspi_stm32_xspi, CONFIG_MSPI_LOG_LEVEL);

/* HAL2 I/O functions take an explicit timeout; same value the legacy HAL
 * used for HAL_XSPI_TIMEOUT_DEFAULT_VALUE.
 */
#define MSPI_STM32_XSPI_TIMEOUT_MS 5000U

static hal_xspi_addr_width_t mspi_stm32_xspi_hal_address_size(uint8_t address_length)
{
	if (address_length == 4U) {
		return HAL_XSPI_ADDR_32BIT;
	}

	return HAL_XSPI_ADDR_24BIT;
}

/**
 * @brief Gives hal_xspi_regular_cmd_t with all parameters set except instruction, addr, size_byte
 */
static hal_xspi_regular_cmd_t mspi_stm32_xspi_prepare_cmd(uint8_t cfg_mode, uint8_t cfg_rate)
{
	/* Command empty structure: all-zero fields are valid HAL2 enum values
	 * (NONE / 8BIT / DISABLED).
	 */
	hal_xspi_regular_cmd_t cmd_tmp = {0};

	cmd_tmp.operation_type = HAL_XSPI_OPERATION_COMMON_CFG;
	cmd_tmp.instruction_width =
		((cfg_mode == MSPI_IO_MODE_OCTAL) && (cfg_rate != MSPI_DATA_RATE_S_D_D))
			? HAL_XSPI_INSTRUCTION_16BIT
			: HAL_XSPI_INSTRUCTION_8BIT;
	cmd_tmp.instruction_dtr_mode_status = (cfg_rate == MSPI_DATA_RATE_DUAL)
						      ? HAL_XSPI_INSTRUCTION_DTR_ENABLED
						      : HAL_XSPI_INSTRUCTION_DTR_DISABLED;

	cmd_tmp.alternate_bytes_mode = HAL_XSPI_ALTERNATE_BYTES_NONE;
	cmd_tmp.addr_dtr_mode_status =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_ADDR_DTR_ENABLED : HAL_XSPI_ADDR_DTR_DISABLED;
	/* addr_width must be set to 32bits for init and mem config phase */
	cmd_tmp.addr_width = HAL_XSPI_ADDR_32BIT;
	cmd_tmp.data_dtr_mode_status =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_DATA_DTR_ENABLED : HAL_XSPI_DATA_DTR_DISABLED;
	cmd_tmp.dqs_mode_status =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_DQS_ENABLED : HAL_XSPI_DQS_DISABLED;

	switch (cfg_mode) {
	case MSPI_IO_MODE_HEX_8_8_16:
		/* No 16-line data phase on this XSPI generation: use 8 lines,
		 * matching the legacy driver fallback.
		 */
	case MSPI_IO_MODE_OCTAL:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_8LINES;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_8LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_8LINES;
		break;

	case MSPI_IO_MODE_QUAD:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_4LINES;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_4LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_4LINES;
		break;

	case MSPI_IO_MODE_DUAL:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_2LINES;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_2LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_2LINES;
		break;

	default:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_1LINE;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_1LINE;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_1LINE;
		break;
	}

	return cmd_tmp;
}

/**
 * @brief Checks if the flash is currently operating in memory-mapped mode.
 */
static bool mspi_stm32_xspi_is_memorymap(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return HAL_XSPI_GetState(&dev_data->hmspi.xspi) == HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE;
}

/**
 * @brief Sets the device back in indirect mode.
 */
static int mspi_stm32_xspi_memmap_off(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	if (!mspi_stm32_xspi_is_memorymap(controller)) {
		return 0;
	}

	if (HAL_XSPI_StopMemoryMappedMode(&dev_data->hmspi.xspi) != HAL_OK) {
		LOG_ERR("MemMapped stop failed");
		return -EIO;
	}
	return 0;
}

/**
 * @brief Sets the device in Memory-Mapped mode.
 */
static int mspi_stm32_xspi_memmap_on(const struct device *controller)
{
	hal_status_t ret;
	struct mspi_stm32_data *dev_data = controller->data;
	hal_xspi_memory_mapped_config_t s_mem_mapped_cfg;

	if (mspi_stm32_xspi_is_memorymap(controller)) {
		return 0;
	}

	/* Configure in MemoryMapped mode */
	if ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE) &&
	    (mspi_stm32_xspi_hal_address_size(dev_data->dev_cfg.addr_length) ==
	     HAL_XSPI_ADDR_24BIT)) {
		/* OPI mode and 3-bytes address size not supported by memory */
		LOG_ERR("MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported");
		return -EIO;
	}

	hal_xspi_regular_cmd_t s_command =
		mspi_stm32_xspi_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	/* Initialize the read command */
	s_command.operation_type = HAL_XSPI_OPERATION_READ_CFG;
	s_command.instruction = dev_data->dev_cfg.read_cmd;
	s_command.addr_width =
		(dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
			? mspi_stm32_xspi_hal_address_size(dev_data->ctx.xfer.addr_length)
			: HAL_XSPI_ADDR_32BIT;
	s_command.dummy_cycle = dev_data->dev_cfg.rx_dummy;

	ret = HAL_XSPI_SendRegularCmd(&dev_data->hmspi.xspi, &s_command,
				      MSPI_STM32_XSPI_TIMEOUT_MS);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped mode");
		return -EIO;
	}

	/* Initializes the program command */
	s_command.operation_type = HAL_XSPI_OPERATION_WRITE_CFG;
	s_command.instruction = dev_data->dev_cfg.write_cmd;
	s_command.dummy_cycle = dev_data->dev_cfg.tx_dummy;
	ret = HAL_XSPI_SendRegularCmd(&dev_data->hmspi.xspi, &s_command,
				      MSPI_STM32_XSPI_TIMEOUT_MS);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped mode");
		return -EIO;
	}

	/* Enables the memory-mapping */
	s_mem_mapped_cfg.timeout_activation = HAL_XSPI_TIMEOUT_DISABLE;
	s_mem_mapped_cfg.timeout_period_cycle = 0U;
	ret = HAL_XSPI_StartMemoryMappedMode(&dev_data->hmspi.xspi, &s_mem_mapped_cfg);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to enable memory mapped mode");
		return -EIO;
	}

