filipembedded/zephyr/drivers/mspi/mspi_stm32_xspi_hal2.c
	return 0;
}

static int mspi_stm32_xspi_context_lock(struct mspi_stm32_context *ctx,
					const struct mspi_xfer *xfer)
{
	if (k_sem_take(&ctx->lock, K_MSEC(xfer->timeout)) < 0) {
		return -EBUSY;
	}

	ctx->xfer = *xfer;
	ctx->packets_left = ctx->xfer.num_packet;
	return 0;
}

static void mspi_stm32_xspi_context_unlock(struct mspi_stm32_context *ctx)
{
	k_sem_give(&ctx->lock);
}

/**
 * Check if the MSPI bus is busy.
 *
 * @param controller MSPI controller device.
 * @return true The MSPI bus is busy.
 * @return false The MSPI bus is idle.
 */
static bool mspi_stm32_xspi_is_inp(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	return k_sem_count_get(&dev_data->ctx.lock) == 0;
}

static int mspi_stm32_xspi_abort_memmap_if_enabled(const struct device *dev)
{
	int ret = 0;

	if (mspi_stm32_xspi_is_memorymap(dev)) {
		ret = mspi_stm32_xspi_memmap_off(dev);
		if (ret != 0) {
			LOG_ERR("Failed to abort memory-mapped mode.");
			return ret;
		}
	}

	return ret;
}

/**
 * @brief Reads/Writes in memory mapped mode.
 *
 */
static int read_write_in_memory_map_mode(const struct device *dev,
					 const struct mspi_xfer_packet *packet)
{
	int ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (packet->data_buf == NULL) {
		LOG_ERR("data buf is null : 0x%x", packet->cmd);
		return -EIO;
	}

	if (!mspi_stm32_xspi_is_memorymap(dev)) {
		ret = mspi_stm32_xspi_memmap_on(dev);
		if (ret != 0) {
			LOG_ERR("Failed to set memory mapped");
			return ret;
		}
	}

	uintptr_t mmap_addr = dev_data->memmap_base_addr + packet->address;

	if (packet->dir == MSPI_RX) {
		LOG_INF("Memory-mapped read from 0x%08lx, len %u", mmap_addr, packet->num_bytes);
		memcpy(packet->data_buf, (void *)mmap_addr, packet->num_bytes);
		k_sleep(K_MSEC(1));
		return 0;
	}

	if (!dev_data->xip_cfg.permission) {
		LOG_INF("Memory-mapped write from 0x%08lx, len %u", mmap_addr, packet->num_bytes);
		memcpy((void *)mmap_addr, packet->data_buf, packet->num_bytes);
		k_sleep(K_MSEC(1));
		return 0;
	}

	ret = mspi_stm32_xspi_abort_memmap_if_enabled(dev);
	if (ret != 0) {
		return ret;
	}

	return -EPROTONOSUPPORT;
}

static hal_status_t read_write_in_indirect_mode(const struct device *dev,
						const struct mspi_xfer_packet *packet,
						uint8_t access_mode)
{
	hal_status_t hal_ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (packet->dir == MSPI_RX) {
		/* Receive the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_XSPI_Receive(&dev_data->hmspi.xspi, packet->data_buf,
						   MSPI_STM32_XSPI_TIMEOUT_MS);
			goto end;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_XSPI_Receive_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
#ifdef CONFIG_MSPI_DMA
		case MSPI_ACCESS_DMA:
			uint8_t *dma_buf = k_aligned_alloc(CONFIG_MSPI_STM32_BUFFER_ALIGNMENT,
							   packet->num_bytes);

			if (dma_buf == NULL) {
				LOG_ERR("DMA buffer allocation failed");
				return HAL_ERROR;
			}

			hal_ret = HAL_XSPI_Receive_DMA(&dev_data->hmspi.xspi, dma_buf);
			if (hal_ret == HAL_OK) {
				if (k_sem_take(&dev_data->sync, K_FOREVER) < 0) {
					LOG_ERR("Failed to take sem");
					k_free(dma_buf);
					return HAL_BUSY;
				}
				memcpy(packet->data_buf, dma_buf, packet->num_bytes);
			}

			k_free(dma_buf);
			goto end;
#endif /* CONFIG_MSPI_DMA */
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	} else {
		/* Transmit the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_XSPI_Transmit(&dev_data->hmspi.xspi, packet->data_buf,
						    MSPI_STM32_XSPI_TIMEOUT_MS);
			goto end;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_XSPI_Transmit_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
#ifdef CONFIG_MSPI_DMA
		case MSPI_ACCESS_DMA:
			hal_ret = HAL_XSPI_Transmit_DMA(&dev_data->hmspi.xspi, packet->data_buf);
			break;
#endif /* CONFIG_MSPI_DMA */
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	}

	if (hal_ret != HAL_OK) {
		goto end;
	}

	/* Lock again expecting the IRQ for end of Tx or Rx */
	if (k_sem_take(&dev_data->sync, K_FOREVER) < 0) {
		LOG_ERR("Failed to take sem");
		return HAL_BUSY;
	}

end:
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to access data");
	}

	return hal_ret;
}

/**
 * @brief Sends a Command to the NOR and Receive/Transceive data if relevant in IT or DMA mode.
 *
 */
static int mspi_stm32_xspi_access(const struct device *dev, const struct mspi_xfer_packet *packet,
				  uint8_t access_mode)
{
	hal_status_t hal_ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (dev_data->xip_cfg.enable) {
		if ((packet->cmd == MSPI_NOR_CMD_WREN) || (packet->cmd == MSPI_NOR_OCMD_WREN) ||
		    (packet->cmd == MSPI_NOR_CMD_SE_4B) || (packet->cmd == MSPI_NOR_OCMD_SE) ||
		    (packet->cmd == MSPI_NOR_CMD_SE) ||
		    ((mspi_stm32_xspi_hal_address_size(dev_data->dev_cfg.addr_length) ==
		      HAL_XSPI_ADDR_24BIT) &&
		     (dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE))) {
			LOG_DBG(" MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported in "
				"memory map mode, switching to indirect mode");

			int ret = mspi_stm32_xspi_abort_memmap_if_enabled(dev);

			if (ret != 0) {
				return ret;
			}
			goto indirect;
		}

		if (read_write_in_memory_map_mode(dev, packet) == -EPROTONOSUPPORT) {
			goto indirect;
		}
		return 0;
	}

indirect:
	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	hal_xspi_regular_cmd_t cmd =
		mspi_stm32_xspi_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	cmd.size_byte = packet->num_bytes;
	cmd.instruction = packet->cmd;
	if (packet->dir == MSPI_TX) {
		cmd.dummy_cycle = dev_data->ctx.xfer.tx_dummy;
	} else {
		cmd.dummy_cycle = dev_data->ctx.xfer.rx_dummy;
	}
	cmd.addr = packet->address; /* addr_width is 32bits in OPSI mode */
	cmd.addr_width = mspi_stm32_xspi_hal_address_size(dev_data->ctx.xfer.addr_length);
	if (cmd.size_byte == 0) {
		cmd.data_mode = HAL_XSPI_REGULAR_DATA_NONE;
	}

	if ((cmd.instruction == MSPI_NOR_CMD_WREN) || (cmd.instruction == MSPI_NOR_OCMD_WREN)) {
		/* Write Enable only accepts HAL_XSPI_ADDR_NONE */
		cmd.addr_mode = HAL_XSPI_ADDR_NONE;
	}

