filipembedded/zephyr/drivers/mspi/mspi_stm32_xspi_hal2.c
	LOG_DBG("MSPI access Instruction 0x%x", cmd.instruction);

	hal_ret = HAL_XSPI_SendRegularCmd(&dev_data->hmspi.xspi, &cmd,
					  MSPI_STM32_XSPI_TIMEOUT_MS);
	if ((hal_ret != HAL_OK) || (packet->num_bytes == 0)) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to send XSPI instruction");
			return -EIO;
		}
		return 0;
	}

	hal_ret = read_write_in_indirect_mode(dev, packet, access_mode);

	/* Async path: handled in ISR callback, so skip PM release here. */
	if ((hal_ret == HAL_OK) && (access_mode == MSPI_ACCESS_ASYNC)) {
		return 0;
	}

	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);

	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to access data");
		return -EIO;
	}

	return 0;
}

/* Start Automatic-Polling mode to wait until the memory is setting mask/value bit */
static int mspi_stm32_xspi_wait_auto_polling(const struct device *dev, uint8_t match_value,
					     uint8_t match_mask, uint32_t timeout_ms)
{
	struct mspi_stm32_data *dev_data = dev->data;
	hal_xspi_auto_polling_config_t s_config = {0};

	/* Set the match to check if the bit is Reset */
	s_config.match_value = match_value;
	s_config.match_mask = match_mask;

	s_config.match_mode = HAL_XSPI_MATCH_MODE_AND;
	s_config.interval_cycle = MSPI_NOR_AUTO_POLLING_INTERVAL;
	s_config.automatic_stop_status = HAL_XSPI_AUTOMATIC_STOP_ENABLED;

	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	if (HAL_XSPI_ExecRegularAutoPoll_IT(&dev_data->hmspi.xspi, &s_config) != HAL_OK) {
		LOG_ERR("XSPI AutoPoll failed");
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return -EIO;
	}

	if (k_sem_take(&dev_data->sync, K_MSEC(timeout_ms)) < 0) {
		LOG_ERR("XSPI AutoPoll wait failed");
		HAL_XSPI_Abort(&dev_data->hmspi.xspi, MSPI_STM32_XSPI_TIMEOUT_MS);
		k_sem_reset(&dev_data->sync);
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return -EIO;
	}

	return 0;
}

/*
 * Reads the status reg of the device
 * Send the RDSR command (according to io_mode/data_rate)
 * Then sets the Autopolling mode with match mask/value bit.
 */
static int mspi_stm32_xspi_status_reg(const struct device *controller, const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;
	struct mspi_stm32_context *ctx = &dev_data->ctx;

	if (xfer->num_packet == 0 || xfer->packets == NULL) {
		LOG_ERR("Status Reg.: wrong parameters");
		return -EFAULT;
	}

	ret = mspi_stm32_xspi_context_lock(ctx, xfer);
	if (ret != 0) {
		return ret;
	}

	(void)pm_device_runtime_get(controller);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	hal_xspi_regular_cmd_t cmd =
		mspi_stm32_xspi_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	if (dev_data->dev_cfg.io_mode == MSPI_IO_MODE_OCTAL) {
		cmd.instruction = MSPI_NOR_OCMD_RDSR;
		cmd.dummy_cycle = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_DUAL)
					  ? MSPI_NOR_DUMMY_REG_OCTAL_DTR
					  : MSPI_NOR_DUMMY_REG_OCTAL;
	} else {
		cmd.instruction = MSPI_NOR_CMD_RDSR;
		cmd.addr_mode = HAL_XSPI_ADDR_NONE;
		cmd.data_mode = HAL_XSPI_REGULAR_DATA_1LINE;
		cmd.dummy_cycle = 0;
		cmd.instruction_mode = HAL_XSPI_INSTRUCTION_1LINE;
	}
	cmd.addr = 0U;
	LOG_DBG("MSPI poll status reg");

	ret = mspi_stm32_xspi_abort_memmap_if_enabled(controller);
	if (ret != 0) {
		goto status_end;
	}

	if (HAL_XSPI_SendRegularCmd(&dev_data->hmspi.xspi, &cmd, MSPI_STM32_XSPI_TIMEOUT_MS) !=
	    HAL_OK) {
		LOG_ERR("Failed to send XSPI instruction");
		ret = -EIO;
		goto status_end;
	}

	ret = mspi_stm32_xspi_wait_auto_polling(controller, MSPI_NOR_MEM_RDY_MATCH,
						MSPI_NOR_MEM_RDY_MASK,
						MSPI_STM32_XSPI_TIMEOUT_MS);

status_end:
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(controller);

	mspi_stm32_xspi_context_unlock(ctx);
	return ret;
}

static void mspi_stm32_xspi_isr(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	HAL_XSPI_IRQHandler(&dev_data->hmspi.xspi);

	k_sem_give(&dev_data->sync);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);
}

#ifdef CONFIG_MSPI_DMA
static __maybe_unused void mspi_stm32_xspi_dma_callback(const struct device *dev, void *arg,
							uint32_t channel, int status)
{
	hal_dma_handle_t *hdma = arg;

	ARG_UNUSED(dev);

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d", channel);
	}

	HAL_DMA_IRQHandler(hdma);
}
#endif

static int mspi_stm32_xspi_validate_freq(uint32_t freq, uint32_t max_freq)
{
	if (freq > max_freq) {
		LOG_ERR("%u, freq is too large", __LINE__);
		return -ENOTSUP;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_io_mode(uint32_t io_mode)
{
	if (io_mode >= MSPI_IO_MODE_MAX) {
		LOG_ERR("%u, Invalid io_mode", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_data_rate(uint32_t data_rate)
{
	if (data_rate >= MSPI_DATA_RATE_MAX) {
		LOG_ERR("%u, Invalid data_rate", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_cpp(uint32_t cpp)
{
	if (cpp > MSPI_CPP_MODE_3) {
		LOG_ERR("%u, Invalid cpp", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_endian(uint32_t endian)
{
	if (endian > MSPI_XFER_BIG_ENDIAN) {
		LOG_ERR("%u, Invalid endian", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_ce_polarity(uint32_t ce_polarity)
{
	if (ce_polarity > MSPI_CE_ACTIVE_HIGH) {
		LOG_ERR("%u, Invalid ce_polarity", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_dqs(bool dqs_enable, bool dqs_support)
{
	if (dqs_enable && !dqs_support) {
		LOG_ERR("%u, DQS mode not supported", __LINE__);
		return -ENOTSUP;
	}
	return 0;
}

static int mspi_stm32_assign_cfg(struct mspi_stm32_data *data,
				 const enum mspi_dev_cfg_mask param_mask,
				 const struct mspi_dev_cfg *dev_cfg,
				 const struct mspi_stm32_conf *cfg)
{
	int ret = 0;

