filipembedded/zephyr/drivers/mspi/mspi_stm32_xspi_hal2.c
	if (mspi_stm32_xspi_is_inp(controller) ||
	    (HAL_XSPI_IsActiveFlag(&dev_data->hmspi.xspi, HAL_XSPI_FLAG_BUSY) ==
	     HAL_XSPI_FLAG_ACTIVE)) {
		ret = -EBUSY;
	}

	return ret;
}

static int mspi_stm32_xspi_pio_dma_transceive(const struct device *controller,
					      const struct mspi_xfer *xfer)
{
	int ret = 0;
	uint32_t packet_idx;
	struct mspi_stm32_data *dev_data = controller->data;
	struct mspi_stm32_context *ctx = &dev_data->ctx;
	const struct mspi_xfer_packet *packet;

	if (xfer->num_packet == 0 || xfer->packets == NULL ||
	    xfer->timeout > CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE) {
		LOG_ERR("Transfer: wrong parameters");
		return -EFAULT;
	}

	ret = mspi_stm32_xspi_context_lock(ctx, xfer);
	if (ret != 0) {
		LOG_ERR("Failed to lock MSPI context");
		return ret;
	}

	while (ctx->packets_left > 0) {
		packet_idx = ctx->xfer.num_packet - ctx->packets_left;
		packet = &ctx->xfer.packets[packet_idx];
#ifdef CONFIG_MSPI_DMA
		const struct mspi_stm32_conf *dev_cfg = controller->config;

		if (dev_cfg->dma_specified) {
			ret = mspi_stm32_xspi_access(controller, packet, MSPI_ACCESS_DMA);
		} else {
			LOG_ERR("DMA configuration is missing from the device tree");
			ret = -EIO;
			goto end;
		}
#else
		ret = mspi_stm32_xspi_access(controller, packet,
					     ctx->xfer.async ? MSPI_ACCESS_ASYNC :
							       MSPI_ACCESS_SYNC);
#endif

		ctx->packets_left--;
		if (ret != 0) {
			ret = -EIO;
			goto end;
		}
	}

end:
	mspi_stm32_xspi_context_unlock(ctx);
	return ret;
}

/**
 * API implementation of mspi_transceive.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param xfer Pointer to the MSPI transfer started by dev_id.
 *
 * @retval 0 if successful.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_xspi_transceive(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;

	if (dev_id != dev_data->dev_id) {
		LOG_ERR("transceive : dev_id don't match");
		return -ESTALE;
	}

	/* Need to map the xfer to the data context */
	dev_data->ctx.xfer = *xfer;

	if ((xfer->packets->cmd == MSPI_NOR_OCMD_RDSR) ||
	    (xfer->packets->cmd == MSPI_NOR_CMD_RDSR)) {
		ret = mspi_stm32_xspi_status_reg(controller, xfer);
	} else {
		ret = mspi_stm32_xspi_pio_dma_transceive(controller, xfer);
	}

	return ret;
}

#ifdef CONFIG_MSPI_DMA
static int mspi_stm32_xspi_dma_init(hal_dma_handle_t *hdma, struct stm32_stream *dma_stream)
{
	int ret;
	hal_dma_direct_xfer_config_t xfer_cfg;

	/*
	 * DMA configuration
	 * Due to use of XSPI HAL API in current driver,
	 * both HAL and Zephyr DMA drivers should be configured.
	 * The required configuration for Zephyr DMA driver should only provide
	 * the minimum information to inform the DMA slot will be in used and
	 * how to route callbacks.
	 */

	if (!device_is_ready(dma_stream->dev)) {
		LOG_ERR("DMA %s device not ready", dma_stream->dev->name);
		return -ENODEV;
	}

	dma_stream->cfg.user_data = hdma;
	/* This field is used to inform driver that it is overridden */
	dma_stream->cfg.linked_channel = STM32_DMA_HAL_OVERRIDE;
	ret = dma_config(dma_stream->dev, dma_stream->channel, &dma_stream->cfg);
	if (ret != 0) {
		LOG_ERR("Failed to configure DMA channel %d", dma_stream->channel);
		return ret;
	}

	/* Proceed to the HAL DMA driver init */
	if (dma_stream->cfg.source_data_size != dma_stream->cfg.dest_data_size) {
		LOG_ERR("DMA Source and destination data sizes not aligned");
		return -EINVAL;
	}

	/*
	 * HAL expects a valid DMA channel.
	 * The channel is from 0 to 7 because of the STM32_DMA_STREAM_OFFSET
	 * in the dma_stm32 driver. The hal_dma_channel_t values are the DMA
	 * channel register base addresses.
	 */
	if (HAL_DMA_Init(hdma, (hal_dma_channel_t)(uint32_t)LL_DMA_GET_CHANNEL_INSTANCE(
					 dma_stream->reg, dma_stream->channel)) != HAL_OK) {
		LOG_ERR("XSPI DMA Init failed");
		return -EIO;
	}

	/* mspi_stm32_table_* hold LL values, which the hal_dma_* enums alias */
	xfer_cfg.request = (hal_dma_request_source_t)dma_stream->cfg.dma_slot;
	xfer_cfg.direction =
		(hal_dma_direction_t)mspi_stm32_table_direction[dma_stream->cfg.channel_direction];
	xfer_cfg.src_inc = (dma_stream->src_addr_increment) ? HAL_DMA_SRC_ADDR_INCREMENTED
							    : HAL_DMA_SRC_ADDR_FIXED;
	xfer_cfg.dest_inc = (dma_stream->dst_addr_increment) ? HAL_DMA_DEST_ADDR_INCREMENTED
							     : HAL_DMA_DEST_ADDR_FIXED;
	xfer_cfg.src_data_width = HAL_DMA_SRC_DATA_WIDTH_BYTE;
	xfer_cfg.dest_data_width = HAL_DMA_DEST_DATA_WIDTH_BYTE;
	xfer_cfg.priority =
		(hal_dma_priority_t)mspi_stm32_table_priority[dma_stream->cfg.channel_priority];

	if (HAL_DMA_SetConfigDirectXfer(hdma, &xfer_cfg) != HAL_OK) {
		LOG_ERR("XSPI DMA config failed");
		return -EIO;
	}

	LOG_DBG("XSPI with DMA transfer");
	return 0;
}
#endif /* CONFIG_MSPI_DMA */

static int mspi_validate_config(const struct mspi_cfg *config, uint32_t max_frequency)
{
	if (config->op_mode != MSPI_OP_MODE_CONTROLLER) {
		LOG_ERR("Only support MSPI controller mode");
		return -ENOTSUP;
	}

	if (config->max_freq > max_frequency) {
		LOG_ERR("Max_freq %d too large", config->max_freq);
		return -ENOTSUP;
	}

	if (config->duplex != MSPI_HALF_DUPLEX) {
		LOG_ERR("Only support half duplex mode");
		return -ENOTSUP;
	}

	if (config->num_periph > MSPI_MAX_DEVICE) {
		LOG_ERR("Invalid MSPI peripheral number");
		return -ENOTSUP;
	}

	return 0;
}

static int mspi_stm32_xspi_activate(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *config = (struct mspi_stm32_conf *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	if (clock_control_on(clk, (clock_control_subsys_t)(uintptr_t)&config->pclken[0]) != 0) {
		return -EIO;
	}

	return 0;
}

static int mspi_hal_init(const struct mspi_stm32_conf *dev_cfg, struct mspi_stm32_data *dev_data,
			 uint32_t ahb_clock_freq)
{
	hal_xspi_config_t hal_cfg = {0};
	uint32_t prescaler = MSPI_STM32_CLOCK_PRESCALER_MIN;

	for (; prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX; prescaler++) {
		dev_data->dev_cfg.freq = MSPI_STM32_CLOCK_COMPUTE(ahb_clock_freq, prescaler);
		if (dev_data->dev_cfg.freq <= dev_cfg->mspicfg.max_freq) {
			break;
		}
	}
	__ASSERT_NO_MSG(prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX);

	/* The hal_xspi_t instance values are the XSPI register base addresses */
	if (HAL_XSPI_Init(&dev_data->hmspi.xspi, (hal_xspi_t)(uintptr_t)dev_cfg->base) !=
	    HAL_OK) {
		LOG_ERR("MSPI Init failed");
		return -EIO;
	}

	hal_cfg.memory.mode = HAL_XSPI_MEMORY_SINGLE;
	hal_cfg.memory.type = HAL_XSPI_MEMORY_TYPE_MICRON;
	/* Same devsize value the legacy driver programs (raw 0x19) */
	hal_cfg.memory.size_bit = HAL_XSPI_MEMORY_SIZE_512MBIT;
	hal_cfg.memory.wrap_size_byte = HAL_XSPI_WRAP_NOT_SUPPORTED;
	hal_cfg.memory.cs_boundary = (hal_xspi_cs_boundary_t)dev_cfg->cs_boundary;
	hal_cfg.timing.clk_prescaler = prescaler;
	hal_cfg.timing.shift = dev_cfg->ssht_enable ? HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE
						    : HAL_XSPI_SAMPLE_SHIFT_NONE;
	hal_cfg.timing.hold = HAL_XSPI_DELAY_HOLD_NONE;
	hal_cfg.timing.cs_high_time_cycle = 1U;
	hal_cfg.timing.cs_refresh_time_cycle = 0U;
	hal_cfg.timing.dlyb_state = HAL_XSPI_DLYB_ON;

