filipembedded/zephyr/drivers/mspi/mspi_stm32_xspi_hal2.c
	if (HAL_XSPI_SetConfig(&dev_data->hmspi.xspi, &hal_cfg) != HAL_OK) {
		LOG_ERR("MSPI SetConfig failed");
		return -EIO;
	}

	if (HAL_XSPI_SetFifoThreshold(&dev_data->hmspi.xspi, MSPI_STM32_FIFO_THRESHOLD) !=
	    HAL_OK) {
		LOG_ERR("MSPI FIFO threshold config failed");
		return -EIO;
	}

	LOG_DBG("MSPI Init'd");
	return 0;
}

#ifdef CONFIG_MSPI_DMA
static int mspi_dma_setup(const struct mspi_stm32_conf *dev_cfg,
			  struct mspi_stm32_data *dev_data)
{
	if (!dev_cfg->dma_specified) {
		LOG_ERR("DMA configuration is missing from the device tree");
		return -EIO;
	}

	if (mspi_stm32_xspi_dma_init(&dev_data->hdma_tx, &dev_data->dma_tx) != 0) {
		LOG_ERR("XSPI DMA Tx init failed");
		return -EIO;
	}
	if (HAL_XSPI_SetTxDMA(&dev_data->hmspi.xspi, &dev_data->hdma_tx) != HAL_OK) {
		LOG_ERR("XSPI DMA Tx link failed");
		return -EIO;
	}

	if (mspi_stm32_xspi_dma_init(&dev_data->hdma_rx, &dev_data->dma_rx) != 0) {
		LOG_ERR("XSPI DMA Rx init failed");
		return -EIO;
	}
	if (HAL_XSPI_SetRxDMA(&dev_data->hmspi.xspi, &dev_data->hdma_rx) != HAL_OK) {
		LOG_ERR("XSPI DMA Rx link failed");
		return -EIO;
	}

	return 0;
}
#endif /* CONFIG_MSPI_DMA */

static int mspi_configure_delay_block(struct mspi_stm32_data *dev_data)
{
#if defined(DLYB_XSPI1) || defined(DLYB_XSPI2) || defined(DLYB_OCTOSPI1) || defined(DLYB_OCTOSPI2)
	uint32_t max_clock_phase;

	/* Delay the sampling clock by a quarter of the output clock period,
	 * as the legacy driver does with PhaseSel = period / 4.
	 */
	if (HAL_XSPI_DLYB_CalculateMaxClockPhase(&dev_data->hmspi.xspi, &max_clock_phase) !=
	    HAL_OK) {
		LOG_ERR("XSPI DelayBlock failed");
		return -EIO;
	}

	if (HAL_XSPI_DLYB_SetConfigDelay(&dev_data->hmspi.xspi, max_clock_phase / 4U) != HAL_OK) {
		LOG_ERR("XSPI DelayBlock failed");
		return -EIO;
	}

	LOG_DBG("Delay Block Init");
#endif
	return 0;
}

/**
 * API implementation of mspi_config : controller configuration.
 *
 * @param spec Pointer to MSPI device tree spec.
 * @return 0 if successful.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_xspi_config(const struct mspi_dt_spec *spec)
{
	int ret;
	const struct mspi_cfg *config = &spec->config;
	const struct mspi_stm32_conf *dev_cfg = spec->bus->config;
	struct mspi_stm32_data *dev_data = spec->bus->data;
	uint32_t ahb_clock_freq;

	ret = mspi_validate_config(config, dev_cfg->mspicfg.max_freq);
	if (ret != 0) {
		return ret;
	}

	(void)pm_device_runtime_get(spec->bus);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	/* pinctrl */
	ret = pinctrl_apply_state(dev_cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("MSPI pinctrl setup failed");
		goto end;
	}

	if (dev_data->dev_cfg.dqs_enable && !dev_cfg->mspicfg.dqs_support) {
		LOG_ERR("MSPI dqs mismatch (not supported but enabled)");
		ret = -ENOTSUP;
		goto end;
	}

	dev_cfg->irq_config();

	ret = mspi_stm32_xspi_activate(spec->bus);
	if (ret != 0) {
		goto end;
	}

	if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				   (clock_control_subsys_t)&dev_cfg->pclken[0],
				   &ahb_clock_freq) < 0) {
		LOG_ERR("Failed call clock_control_get_rate(pclken)");
		ret = -EIO;
		goto end;
	}

#ifdef CONFIG_MSPI_DMA
	if (dev_cfg->dma_specified) {
		dev_data->dma_tx.reg = (DMA_TypeDef *)dev_data->dma_tx.phys_addr;
		dev_data->dma_rx.reg = (DMA_TypeDef *)dev_data->dma_rx.phys_addr;
	}
#endif

	ret = mspi_hal_init(dev_cfg, dev_data, ahb_clock_freq);
	if (ret != 0) {
		goto end;
	}

	ret = mspi_configure_delay_block(dev_data);
	if (ret != 0) {
		goto end;
	}

#ifdef CONFIG_MSPI_DMA
	ret = mspi_dma_setup(dev_cfg, dev_data);
	if (ret != 0) {
		goto end;
	}
#endif

	if (k_sem_count_get(&dev_data->ctx.lock) == 0) {
		k_sem_give(&dev_data->ctx.lock);
	}
	if (config->re_init) {
		k_mutex_unlock(&dev_data->lock);
	}

end:
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(spec->bus);

	if (ret == 0) {
		LOG_INF("MSPI configured");
	}

	return ret;
}

/**
 * Set up and config a new controller.
 *
 * @param dev MSPI controller.
 *
 * @retval 0 if successful.
 */
static int mspi_stm32_init(const struct device *controller)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	const struct mspi_dt_spec spec = {
		.bus = controller,
		.config = cfg->mspicfg,
	};

	return mspi_stm32_xspi_config(&spec);
}

#if defined(CONFIG_MSPI_TIMING)
static int mspi_stm32_timing_config(const struct device *dev,
				    const struct mspi_dev_id *dev_id,
				    const uint32_t param_mask, void *cfg)
{
	struct mspi_stm32_data *dev_data = dev->data;
	struct mspi_stm32_timing_cfg *config = cfg;

	if (config->turnaround_cycles != 0) {
		/* Required for PSRAM where tx_dummy = total latency (WLC),
		 * while STM32 XSPI expects dummy cycles excluding turnaround.
		 */
		dev_data->dev_cfg.tx_dummy = dev_data->dev_cfg.tx_dummy - config->turnaround_cycles;
	}

	return 0;
}
#endif /* defined(CONFIG_MSPI_TIMING) */

static DEVICE_API(mspi, mspi_stm32_driver_api) = {
	.config = mspi_stm32_xspi_config,
	.dev_config = mspi_stm32_xspi_dev_config,
	.xip_config = mspi_stm32_xspi_xip_config,
	.get_channel_status = mspi_stm32_xspi_get_channel_status,
	.transceive = mspi_stm32_xspi_transceive,
#if defined(CONFIG_MSPI_TIMING)
	.timing_config = mspi_stm32_timing_config,
#endif
};

#ifdef CONFIG_PM_DEVICE
static int mspi_stm32_xspi_suspend(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *cfg = (struct mspi_stm32_conf *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	/* Disable device clock. */
	ret = clock_control_off(clk, (clock_control_subsys_t)(uintptr_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("Failed to disable MSPI clock during PM suspend process");
		return ret;
	}

	/* Move pins to sleep state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
	if (ret == -ENOENT) {
		/* Warn but don't block suspend */
		LOG_WRN_ONCE("MSPI pinctrl sleep state not available");
		return 0;
	}

	return ret;
}

